
# 问卷题目

questions_pns  = [
    "自主性 - 正向题 - 对于我所做的事情，我有可以自己去自由选择的感觉",
    "自主性 - 反向题 - 我觉得我所做的事情大多都是出于不得已才去做的",
    "关联性 - 正向题 - 我觉得我在乎的人也在乎着我",
    "关联性 - 反向题 - 我觉得被我想要融入的群体排挤",
    "能力 - 正向题 - 我有信心自己能把事情做好",
    "能力 - 反向题 - 我怀疑自己是否真的能把事情做好",
    "自主性 - 正向题 - 我感觉我的决定反映了我真正想要的",
    "自主性 - 反向题 - 我觉得我要被迫做很多我自己不会选择去做的事情",
    "关联性 - 正向题 - 对在乎我和我在乎的人，我觉得我和他们的心是连着的",
    "关联性 - 反向题 - 对我来说重要的人，我却感到他们对我冷漠，让我有距离感",
    "能力 - 正向题 - 我觉得自己做事能力挺强的",
    "能力 - 反向题 - 我对自己的许多表现感到失望",
    "自主性 - 正向题 - 我感觉我所做的选择表达了我真实的自己",
    "自主性 - 反向题 - 我做了太多感觉有压力才去做的事",
    "关联性 - 正向题 - 那些对我来说重要的人，我觉得和他们有一种亲近感",
    "关联性 - 反向题 - 我感觉和我经常相处在一起的人讨厌我",
    "能力 - 正向题 - 我觉得我有能力去达成自己的目标",
    "能力 - 反向题 - 我对自己的能力缺乏信心没有安全感",
    "自主性 - 正向题 - 我感觉我一直在做自己真正感兴趣的事情",
    "自主性 - 反向题 - 我觉得我的日常活动像一串我不得不去完成的任务",
    "关联性 - 正向题 - 我和经常相处的人在一起时，能感受到温暖的感觉",
    "关联性 - 反向题 - 我感觉自己和别人的交往都只是很表面的",
    "能力 - 正向题 - 我感到我能成功完成有难度的任务",
    "能力 - 反向题 - 我犯下的一些错误让我觉得自己挺失败的"]

questions_resilience = [
    "力量 - 正向题 - 能够适应变化",
    "乐观性 - 正向题 - 有亲密和可信赖的人际关系",
    "乐观性 - 正向题 - 有时候运气不错",
    "乐观性 - 正向题 - 能够处理好发生的任何事情",
    "力量 - 正向题 - 过去的成功经历使你有信心来面对新的挑战",
    "乐观性 - 正向题 - 看到事情乐观的一面",
    "力量 - 正向题 - 应对压力的能力不断增强",
    "力量 - 正向题 - 在遭遇疾病或困难之后能够很快恢复",
    "力量 - 正向题 - 认为事出必有因",
    "力量 - 正向题 - 无论做什么都会竭尽全力",
    "坚韧 - 正向题 - 能够实现自己的目标",
    "坚韧 - 正向题 - 即使事情看来没希望了，也不放弃",
    "坚韧 - 正向题 - 知道到哪里寻求帮助",
    "坚韧 - 正向题 - 在压力下，仍能神情专注、头脑清醒",
    "坚韧 - 正向题 - 愿意率先带头去解决问题",
    "坚韧 - 正向题 - 不容易被失败挫伤勇气",
    "坚韧 - 正向题 - 自认是个强者",
    "坚韧 - 正向题 - 勇于作出他人不愿或难以作出的决定",
    "坚韧 - 正向题 - 能够掌控不良情绪",
    "坚韧 - 反向题 - 处理生活难题，有时不得不依靠直觉行事",
    "坚韧 - 正向题 - 有强烈的使命感",
    "坚韧 - 正向题 - 能够管理好自己的生活",
    "坚韧 - 正向题 - 喜欢接受挑战",
    "力量 - 正向题 - 致力于实现自己的目标",
    "力量 - 正向题 - 为自己取得的成就而自豪"]

questions_pns1  = [
    "自主性 - 正向题 - 对于我所做的事情，我有可以自己去自由选择的感觉",
    "自主性 - 反向题 - 我觉得我所做的事情大多都是出于不得已才去做的",
    "关联性 - 正向题 - 我觉得我在乎的人也在乎着我",
    "关联性 - 反向题 - 我觉得被我想要融入的群体排挤",
    "能力 - 正向题 - 我有信心自己能把事情做好",
    "能力 - 反向题 - 我怀疑自己是否真的能把事情做好",
    "自主性 - 正向题 - 我感觉我的决定反映了我真正想要的",
    "自主性 - 反向题 - 我觉得我要被迫做很多我自己不会选择去做的事情",
    "关联性 - 正向题 - 对在乎我和我在乎的人，我觉得我和他们的心是连着的",
    "关联性 - 反向题 - 对我来说重要的人，我却感到他们对我冷漠，让我有距离感",
    "能力 - 正向题 - 我觉得自己做事能力挺强的",
    "能力 - 反向题 - 我对自己的许多表现感到失望",
    "自主性 - 正向题 - 我感觉我所做的选择表达了我真实的自己",
    "自主性 - 反向题 - 我做了太多感觉有压力才去做的事",
    "关联性 - 正向题 - 那些对我来说重要的人，我觉得和他们有一种亲近感",
    "关联性 - 反向题 - 我感觉和我经常相处在一起的人讨厌我",
    "能力 - 正向题 - 我觉得我有能力去达成自己的目标",
    "能力 - 反向题 - 我对自己的能力缺乏信心没有安全感",
    "自主性 - 正向题 - 我感觉我一直在做自己真正感兴趣的事情",
    "自主性 - 反向题 - 我觉得我的日常活动像一串我不得不去完成的任务",
    "关联性 - 正向题 - 我和经常相处的人在一起时，能感受到温暖的感觉",
    "关联性 - 反向题 - 我感觉自己和别人的交往都只是很表面的",
    "能力 - 正向题 - 我感到我能成功完成有难度的任务",
    "能力 - 反向题 - 我犯下的一些错误让我觉得自己挺失败的",
    "000 - 正向题 - 总分",
    
    ]

questions_resilience1 = [
    "力量 - 正向题 - 能够适应变化",
    "乐观性 - 正向题 - 有亲密和可信赖的人际关系",
    "乐观性 - 正向题 - 有时候运气不错",
    "乐观性 - 正向题 - 能够处理好发生的任何事情",
    "力量 - 正向题 - 过去的成功经历使你有信心来面对新的挑战",
    "乐观性 - 正向题 - 看到事情乐观的一面",
    "力量 - 正向题 - 应对压力的能力不断增强",
    "力量 - 正向题 - 在遭遇疾病或困难之后能够很快恢复",
    "力量 - 正向题 - 认为事出必有因",
    "力量 - 正向题 - 无论做什么都会竭尽全力",
    "坚韧 - 正向题 - 能够实现自己的目标",
    "坚韧 - 正向题 - 即使事情看来没希望了，也不放弃",
    "坚韧 - 正向题 - 知道到哪里寻求帮助",
    "坚韧 - 正向题 - 在压力下，仍能神情专注、头脑清醒",
    "坚韧 - 正向题 - 愿意率先带头去解决问题",
    "坚韧 - 正向题 - 不容易被失败挫伤勇气",
    "坚韧 - 正向题 - 自认是个强者",
    "坚韧 - 正向题 - 勇于作出他人不愿或难以作出的决定",
    "坚韧 - 正向题 - 能够掌控不良情绪",
    "坚韧 - 反向题 - 处理生活难题，有时不得不依靠直觉行事",
    "坚韧 - 正向题 - 有强烈的使命感",
    "坚韧 - 正向题 - 能够管理好自己的生活",
    "坚韧 - 正向题 - 喜欢接受挑战",
    "力量 - 正向题 - 致力于实现自己的目标",
    "力量 - 正向题 - 为自己取得的成就而自豪",
    "000 - 正向题 - 总分",
    ]

# 创建 JSON 问卷得分函数
def create_questionnaire_json(user_data, questions):
    user_id = str(user_data[0])
    scores = user_data[1:]
    questionnaire = {}

    for i in range(len(scores)):
        questionnaire[questions[i]] =  scores[i]

    questionnaire["user_id"] = user_id

    return questionnaire


def questioniare_data_json(data, questionaire):
    userList_json = []
# 生成示例用户的问卷 JSON 数据
    for user in data:
        user_questionnaire_json = create_questionnaire_json(user, questionaire)
        userList_json.append(user_questionnaire_json)
        # print(user_questionnaire_json)
    return userList_json


def calculate_scores_and_generate_report(scores):
    # 用于保存计算后的维度和得分
    dimensions = {}

    # 遍历得分
    for key, value in scores.items():
        if 'user_id' in key:
            continue
        # 解析key中的信息
        parts = key.split(' - ')
        dimension = parts[0]
        question_type = parts[1]
        
        # 根据题目类型调整分数
        adjusted_score = 6 - value if "反向题" in question_type else value
        
        # 收集每个维度的分数
        if dimension not in dimensions:
            dimensions[dimension] = []
        dimensions[dimension].append(adjusted_score)

    # 计算每个维度的平均分并生成报告
    report = "数据报告:\n"
    for dimension, scores in dimensions.items():
        average_score = sum(scores) / len(scores)
        report += f"{dimension} 的平均得分: {average_score:.2f}\n"

    return report



'''baseline'''
#反向记分未处理 = 33人
user_scores_pns_1 = [
    [13050920803 ,3 ,2 ,5 ,1 ,4 ,3 ,4 ,4 ,4 ,1 ,4 ,3 ,4 ,4 ,5 ,1 ,3 ,3 ,4 ,3 ,5 ,3 ,4 ,3],
    [13370792083 ,4 ,2 ,3 ,3 ,4 ,3 ,3 ,4 ,3 ,3 ,4 ,2 ,4 ,4 ,3 ,2 ,4 ,2 ,3 ,3 ,3 ,3 ,4 ,3],
    [13523426691 ,3 ,2 ,3 ,1 ,3 ,3 ,4 ,3 ,2 ,3 ,4 ,2 ,4 ,3 ,4 ,3 ,3 ,2 ,4 ,4 ,3 ,3 ,3 ,2],
    [13662064265 ,4 ,2 ,4 ,1 ,5 ,1 ,4 ,2 ,3 ,1 ,4 ,1 ,4 ,1 ,3 ,1 ,4 ,2 ,5 ,2 ,4 ,1 ,4 ,1],
    [13764851394 ,4 ,2 ,3 ,2 ,3 ,4 ,3 ,4 ,4 ,3 ,3 ,4 ,4 ,3 ,3 ,1 ,3 ,5 ,2 ,4 ,4 ,2 ,3 ,5],
    [13896520229 ,4 ,2 ,3 ,1 ,3 ,4 ,3 ,3 ,3 ,3 ,2 ,3 ,2 ,4 ,4 ,1 ,3 ,4 ,2 ,2 ,4 ,2 ,2 ,4],
    [13916874074 ,4 ,2 ,4 ,3 ,4 ,3 ,5 ,2 ,2 ,4 ,3 ,4 ,4 ,3 ,3 ,4 ,4 ,4 ,3 ,2 ,3 ,4 ,4 ,4],
    [13918664140 ,5 ,2 ,5 ,1 ,3 ,3 ,4 ,2 ,4 ,2 ,3 ,3 ,3 ,2 ,4 ,1 ,3 ,2 ,3 ,2 ,4 ,3 ,3 ,2],
    [15073142501 ,4 ,2 ,4 ,1 ,4 ,2 ,4 ,3 ,5 ,1 ,5 ,1 ,4 ,1 ,5 ,1 ,4 ,1 ,4 ,1 ,5 ,2 ,4 ,2],
    [15111816459 ,4 ,1 ,4 ,1 ,5 ,1 ,4 ,1 ,5 ,1 ,5 ,1 ,4 ,2 ,4 ,1 ,4 ,2 ,3 ,3 ,4 ,3 ,2 ,2],
    [15178181483 ,4 ,2 ,3 ,2 ,3 ,2 ,4 ,2 ,4 ,3 ,3 ,2 ,3 ,2 ,3 ,2 ,3 ,3 ,3 ,1 ,3 ,2 ,3 ,2],
    [15956956373 ,4 ,2 ,4 ,1 ,2 ,3 ,4 ,2 ,5 ,2 ,2 ,3 ,2 ,4 ,5 ,1 ,2 ,4 ,2 ,1 ,5 ,2 ,2 ,3],
    [17807988871 ,4 ,2 ,3 ,3 ,2 ,4 ,2 ,4 ,2 ,4 ,4 ,4 ,2 ,1 ,4 ,4 ,3 ,5 ,2 ,4 ,3 ,4 ,3 ,5],
    [17857310325 ,4 ,2 ,5 ,2 ,3 ,2 ,2 ,2 ,5 ,2 ,3 ,4 ,4 ,2 ,4 ,2 ,4 ,2 ,3 ,3 ,5 ,2 ,4 ,2],
    [17859910206 ,3 ,3 ,5 ,3 ,3 ,3 ,3 ,5 ,5 ,1 ,3 ,4 ,3 ,5 ,5 ,1 ,3 ,5 ,3 ,3 ,5 ,3 ,1 ,3],
    [18038829820 ,5 ,1 ,5 ,1 ,5 ,4 ,5 ,5 ,5 ,1 ,5 ,1 ,5 ,5 ,5 ,1 ,5 ,1 ,1 ,5 ,5 ,5 ,5 ,4],
    [18049067425 ,2 ,4 ,4 ,2 ,1 ,5 ,4 ,4 ,2 ,2 ,2 ,4 ,2 ,4 ,4 ,2 ,2 ,5 ,2 ,2 ,4 ,2 ,1 ,4],
    [18120040923 ,4 ,2 ,4 ,2 ,4 ,2 ,5 ,3 ,4 ,2 ,4 ,2 ,4 ,3 ,4 ,1 ,4 ,2 ,3 ,3 ,3 ,2 ,4 ,3],
    [18150061030 ,3 ,3 ,4 ,2 ,4 ,4 ,2 ,4 ,4 ,3 ,4 ,3 ,3 ,3 ,4 ,2 ,4 ,2 ,2 ,3 ,4 ,4 ,4 ,3],
    [18159658021 ,3 ,1 ,3 ,3 ,4 ,2 ,3 ,3 ,3 ,3 ,3 ,4 ,3 ,2 ,3 ,1 ,3 ,2 ,4 ,2 ,3 ,5 ,3 ,4],
    [18208660066 ,4 ,2 ,4 ,2 ,4 ,2 ,4 ,3 ,3 ,2 ,4 ,2 ,5 ,3 ,4 ,2 ,4 ,4 ,4 ,4 ,3 ,4 ,4 ,2],
    [18268155717 ,4 ,3 ,4 ,3 ,4 ,5 ,3 ,3 ,4 ,3 ,4 ,1 ,4 ,2 ,4 ,2 ,5 ,2 ,4 ,2 ,5 ,2 ,5 ,2],
    [18368437211 ,4 ,2 ,4 ,2 ,4 ,2 ,5 ,2 ,4 ,2 ,4 ,2 ,4 ,3 ,5 ,1 ,5 ,2 ,5 ,1 ,4 ,2 ,4 ,3],
    [18372772013 ,4 ,3 ,5 ,2 ,4 ,2 ,4 ,2 ,5 ,2 ,5 ,2 ,5 ,2 ,5 ,1 ,5 ,2 ,5 ,4 ,5 ,1 ,4 ,2],
    [18586127686 ,5 ,1 ,3 ,1 ,5 ,1 ,5 ,1 ,3 ,1 ,5 ,1 ,5 ,1 ,4 ,1 ,5 ,1 ,5 ,1 ,4 ,3 ,5 ,1],
    [18742527817 ,4 ,2 ,4 ,1 ,5 ,1 ,4 ,1 ,4 ,1 ,4 ,1 ,3 ,2 ,4 ,1 ,5 ,2 ,3 ,3 ,4 ,5 ,5 ,2],
    [18924915953 ,3 ,3 ,3 ,2 ,3 ,3 ,2 ,3 ,3 ,2 ,2 ,2 ,2 ,3 ,4 ,3 ,3 ,4 ,2 ,3 ,3 ,3 ,2 ,4],
    [18931628795 ,5 ,1 ,5 ,1 ,5 ,3 ,5 ,1 ,5 ,1 ,3 ,3 ,5 ,1 ,5 ,1 ,5 ,1 ,5 ,1 ,5 ,4 ,4 ,4],
    [18963809846 ,4 ,2 ,5 ,1 ,4 ,4 ,5 ,1 ,4 ,1 ,5 ,2 ,5 ,3 ,4 ,1 ,4 ,4 ,4 ,1 ,3 ,4 ,5 ,3],
    [19119732512 ,3 ,2 ,4 ,2 ,4 ,2 ,3 ,1 ,4 ,1 ,3 ,1 ,3 ,2 ,5 ,1 ,5 ,1 ,3 ,2 ,3 ,4 ,5 ,3],
    [19527398569 ,5 ,1 ,5 ,1 ,5 ,1 ,4 ,1 ,4 ,1 ,5 ,1 ,3 ,2 ,4 ,1 ,5 ,2 ,4 ,1 ,1 ,2 ,3 ,2],
    [19707045120 ,3 ,3 ,3 ,3 ,2 ,4 ,4 ,5 ,3 ,4 ,3 ,2 ,3 ,3 ,3 ,2 ,3 ,4 ,1 ,3 ,3 ,4 ,3 ,3],
    [19818277026 ,3 ,2 ,4 ,1 ,3 ,3 ,4 ,4 ,5 ,1 ,4 ,2 ,4 ,3 ,5 ,1 ,4 ,2 ,4 ,2 ,5 ,4 ,3 ,3]]


#反向记分的内容未处理 = 33人
user_scores_Resilience_1 = [
    [13050920803,4,5,5,4,5,4,5,4,3,3,4,4,4,4,4,4,3,3,3,2,4,3,3,3,5],
    [13370792083,4,3,4,3,4,3,4,3,3,3,4,4,4,3,3,4,4,3,4,2,4,4,3,4,4],
    [13523426691,4,3,3,3,3,3,4,3,5,3,2,3,2,3,3,3,2,4,3,2,4,4,3,4,4
    ],[13662064265,4,4,3,4,4,5,4,2,2,4,4,3,5,4,5,4,5,5,5,2,4,4,4,5,5
    ],[13764851394,4,3,4,3,2,2,3,1,2,3,3,2,2,2,2,2,1,1,2,2,4,2,2,3,4
    ],[13896520229,3,4,4,3,3,4,4,3,3,3,3,3,4,3,4,2,1,3,3,2,4,4,3,3,4
    ],[13916874074,4,3,5,4,3,2,4,3,5,3,4,3,3,4,2,2,3,3,4,1,5,4,3,4,3
    ],[13918664140,4,4,4,3,4,4,4,3,3,4,3,2,4,4,2,4,2,3,3,3,3,4,2,3,4
    ],[15073142501,4,5,4,4,4,4,4,4,4,4,4,4,5,4,4,4,4,4,4,3,3,4,3,4,5
    ],[15111816459,5,4,4,4,4,4,4,4,4,4,5,4,4,4,3,4,3,3,3,3,3,4,3,3,5
    ],[15178181483,4,4,4,3,3,3,4,3,3,3,3,4,4,3,4,4,3,3,3,2,4,3,3,4,5
    ],[15956956373,2,4,4,2,2,4,4,4,4,2,3,2,4,2,2,3,2,2,3,2,4,4,2,4,5
    ],[17807988871,4,3,4,4,3,4,5,4,5,2,3,2,4,4,5,2,3,4,2,3,3,2,3,3,4
    ],[17857310325,3,5,3,2,4,4,4,3,4,2,3,2,4,3,3,3,2,2,2,2,4,2,5,4,2
    ],[17859910206,3,3,3,3,3,4,4,3,4,3,3,5,3,3,2,3,3,2,3,2,4,3,3,3,4
    ],[18038829820,5,5,5,2,5,1,2,1,5,5,5,5,5,2,5,2,5,5,1,1,5,5,5,5,5
    ],[18049067425,2,4,4,3,2,2,2,4,4,1,2,1,4,2,3,2,1,2,3,2,4,2,1,2,3
    ],[18120040923,4,4,4,3,4,4,4,4,3,3,4,4,4,4,4,4,4,4,4,2,4,4,4,4,5
    ],[18150061030,4,4,4,3,4,4,4,4,4,3,4,4,4,4,4,4,4,4,4,2,4,4,4,4,4
    ],[18159658021,5,3,5,2,3,2,3,4,4,1,3,4,2,2,4,4,2,3,3,3,3,2,2,3,5
    ],[18208660066,5,3,4,4,4,4,3,2,5,3,4,3,2,3,4,2,3,4,3,1,5,4,5,4,5
    ],[18268155717,5,5,5,5,5,5,4,4,4,4,5,4,4,4,5,4,4,5,3,2,4,5,5,5,5
    ],[18368437211,4,5,3,4,3,4,5,2,3,3,3,3,4,4,5,4,3,4,3,2,4,4,4,5,5
    ],[18372772013,4,5,1,4,4,5,5,4,5,4,3,5,5,4,5,4,3,4,3,1,5,4,5,4,5
    ],[18586127686,5,5,5,5,5,5,5,5,4,4,5,4,5,5,5,4,5,5,5,3,3,5,5,5,5
    ],[18742527817,4,4,4,4,4,4,4,4,2,4,4,2,3,4,2,4,4,4,4,1,5,4,3,4,4
    ],[18924915953,3,4,4,4,4,4,4,4,4,4,4,4,4,4,3,3,2,3,3,3,3,3,3,3,4
    ],[18931628795,5,5,5,5,5,5,3,5,5,3,3,5,3,5,5,5,3,3,5,1,5,5,5,5,5
    ],[18963809846,4,4,3,3,3,2,4,4,4,5,3,2,4,4,4,2,3,3,3,2,4,4,4,4,4
    ],[19119732512,5,4,5,3,3,3,5,3,3,2,4,5,5,3,4,5,3,5,3,5,1,2,1,5,5
    ],[19527398569,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,2,4,5,5,5
    ],[19707045120,3,3,2,1,2,3,4,3,4,3,3,3,3,3,3,2,2,2,3,2,4,3,3,4,4
    ],[19818277026,4,4,4,3,4,2,4,4,5,3,3,2,4,4,2,2,3,4,4,2,4,4,2,4,4]]

'''week1'''
user_scores_bpn_2 = [


]

user_scores_Resilience_2 = []
